#STARTUP values overview,content,showall,showeverything
#+STARTUP: showeverything

*** TODO test
**** DONE test2
**** DONE test3

*** TODO test2

# Mark values and with C-SPC and press C-c | to create a table around these values
Name Phone Age

->

| Name Phone Age |

# Every line that starts with |- acts as a seperator press TAB

|Name|Phone|Age|
|-

->

| Name | Phone | Age |
|------+-------+-----|
|      |       |     |

# Over a field in a table press C-c SPC to clear it


| Name | Phone | Age |
|------+-------+-----|
|      |       |     |

->

|      | Phone | Age |
|------+-------+-----|
|      |       |     |

# M-right to move a column to the left


| Name | Phone | Age |
|------+-------+-----|
|      |       |     |

->

| Phone | Name | Age |
|-------+------+-----|
|       |      |     |

# Move up down row with M-S-UP/DOWN


| Name | Phone | Age |
|------+-------+-----|
|      |       |     |

->

|------+-------+-----|
| Name | Phone | Age |
|      |       |     |

# Calculate sum of current column with C-c + and then paste it with C-y


| Name    | Age | Phone |
|---------+-----+-------|
| John    |  20 |       |
| Foivos  |  40 |       |
| Miranda |  60 |       |
| Giorgos |  80 |       |

->

| Name        | Age | Phone |
|-------------+-----+-------|
| John        |  20 |       |
| Foivos      |  40 |       |
| Miranda     |  60 |       |
| Giorgos     |  80 |       |
|-------------+-----+-------|
| Sum of ages | 200 |       |


# Specify a width for a column before it gets too long
# If i want to see the whole text mouse over and a pop up will appear
# If i want to edit the text, press C-c `

| Name    |   Age |    Phone |
|---------+-------+----------|
| Blank   | Blank |    Blank |
| John    |    20 | 69823102 |
| Foivos  |    40 | 69823102 |
| Miranda |    60 | 69823102 |
| Giorgos |    80 | 69823102 |

->

| Name    |   Age |  Phone |
|---------+-------+--------|
| Blank   | Blank |    <6> |
| John    |    20 | 69823103 |
| Foivos  |    40 | 69823104 |
| Miranda |    60 | 69823105 |
| Giorgos |    80 | 69823106 |

# You can make specific formulas for example calculate the mean

| Name    | Maths | Physics | Mean |
|---------+-------+---------+------|
| Foivos  |    20 |      20 |      |
| Giorgos |    20 |      18 |      |
| Miranda |    17 |      13 |      |

->

# Calculate Mean from columns 2 and 3 and place it in column 4
| Name    | Maths | Physics | Mean |
|---------+-------+---------+------|
| Foivos  |    20 |      20 |   20 |
| Giorgos |    20 |      18 |   19 |
| Miranda |    17 |      13 |   15 |
#+TBLFM: $4=vmean($2..$3)

# Calculate Sum from columns 2 and 3 and place it in column 4
| Name    | Maths | Physics | Sum |
|---------+-------+---------+-----|
| Foivos  |    20 |      20 |  40 |
| Giorgos |    20 |      18 |  38 |
| Miranda |    17 |      13 |  30 |
#+TBLFM: $4=vsum($2..$3)

# Subtract from columns 2 and 3 and place it in column 4
| Name    | Maths | Physics | Sub |
|---------+-------+---------+-----|
| Foivos  |    20 |      20 |   0 |
| Giorgos |    20 |      18 |   2 |
| Miranda |    17 |      13 |   4 |
#+TBLFM: $4=$2-$3

# Divide columns 2 and 3 and place it in column 4
| Name    | Maths | Physics |       Div |
|---------+-------+---------+-----------|
| Foivos  |    20 |      20 |         1 |
| Giorgos |    20 |      18 | 1.1111111 |
| Miranda |    17 |      13 | 1.3076923 |
#+TBLFM: $4=$2/$3

# Multiply columns 2 and 3 and divide it with the value
# of 4th line in the 3rd column and place it in column 4
| Name    | Maths | Physics | Mul and divide |
|---------+-------+---------+----------------|
| Foivos  |    20 |      20 |      30.769231 |
| Giorgos |    20 |      18 |      27.692308 |
| Miranda |    17 |      13 |             17 |
#+TBLFM: $4=($2*$3)/@4$3
